tutorials/coodles/pitzDaily/constant/probeLocations
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          probeLocations;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

probeLocations  
(
);


// ************************************************************************* //
